Fixing self-improvement
